; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-3-46)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	package35 - package
	package36 - package
	package37 - package
	package38 - package
	package39 - package
	package40 - package
	package41 - package
	package42 - package
	package43 - package
	package44 - package
	package45 - package
	package46 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-1 - location
	p0-6 - location
	p1-2 - location
	p1-3 - location
	p3-1 - location
	p3-2 - location
	p3-4 - location
	p4-0 - location
	p4-2 - location
	p4-3 - location
	p4-5 - location
	p5-0 - location
	p5-1 - location
	p5-4 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s2)
	(at driver4 s0)
	(at driver5 s3)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s5)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at package1 s1)
	(at package2 s5)
	(at package3 s1)
	(at package4 s5)
	(at package5 s5)
	(at package6 s4)
	(at package7 s0)
	(at package8 s6)
	(at package9 s2)
	(at package10 s5)
	(at package11 s2)
	(at package12 s5)
	(at package13 s2)
	(at package14 s1)
	(at package15 s3)
	(at package16 s5)
	(at package17 s3)
	(at package18 s2)
	(at package19 s2)
	(at package20 s5)
	(at package21 s5)
	(at package22 s2)
	(at package23 s5)
	(at package24 s4)
	(at package25 s6)
	(at package26 s6)
	(at package27 s6)
	(at package28 s2)
	(at package29 s4)
	(at package30 s3)
	(at package31 s3)
	(at package32 s6)
	(at package33 s3)
	(at package34 s3)
	(at package35 s4)
	(at package36 s5)
	(at package37 s3)
	(at package38 s6)
	(at package39 s6)
	(at package40 s6)
	(at package41 s3)
	(at package42 s6)
	(at package43 s1)
	(at package44 s4)
	(at package45 s2)
	(at package46 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(link s0 s3)
	(link s3 s0)
	(link s1 s3)
	(link s3 s1)
	(link s2 s3)
	(link s3 s2)
	(link s2 s5)
	(link s5 s2)
	(link s4 s1)
	(link s1 s4)
	(link s4 s6)
	(link s6 s4)
	(link s5 s0)
	(link s0 s5)
	(link s5 s1)
	(link s1 s5)
	(link s5 s3)
	(link s3 s5)
	(link s5 s4)
	(link s4 s5)
	(link s5 s6)
	(link s6 s5)
	(link s6 s1)
	(link s1 s6)
)
	(:goal (and
	(at driver1 s1)
	(at driver3 s1)
	(at driver4 s2)
	(at driver5 s0)
	(at truck1 s1)
	(at truck2 s1)
	(at truck3 s5)
	(at package1 s3)
	(at package2 s0)
	(at package3 s1)
	(at package4 s2)
	(at package5 s5)
	(at package6 s6)
	(at package7 s3)
	(at package8 s5)
	(at package9 s4)
	(at package10 s1)
	(at package11 s2)
	(at package12 s1)
	(at package13 s2)
	(at package14 s1)
	(at package16 s4)
	(at package17 s4)
	(at package18 s4)
	(at package19 s6)
	(at package21 s6)
	(at package22 s5)
	(at package23 s1)
	(at package24 s2)
	(at package25 s5)
	(at package26 s4)
	(at package27 s1)
	(at package29 s0)
	(at package30 s5)
	(at package31 s3)
	(at package32 s6)
	(at package33 s4)
	(at package34 s2)
	(at package35 s2)
	(at package36 s1)
	(at package37 s0)
	(at package38 s3)
	(at package39 s0)
	(at package40 s3)
	(at package41 s0)
	(at package42 s6)
	(at package43 s3)
	(at package44 s6)
	(at package45 s3)
	(at package46 s1)
	))


)

; plan
1. (walk driver2 s0 p5-0)
   deleted: (at driver2 s0)
   added: (at driver2 p5-0)
   goals met: 9 of 50
2. (walk driver2 p5-0 s5)
   deleted: (at driver2 p5-0)
   added: (at driver2 s5)
   goals met: 9 of 50
3. (board-truck driver2 s5 truck2)
   deleted: (at driver2 s5) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 9 of 50
4. (board-truck driver3 s2 truck1)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 9 of 50
5. (board-truck driver5 s3 truck3)
   deleted: (at driver5 s3) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 9 of 50
6. (load-truck s2 package9 truck1)
   deleted: (at package9 s2)
   added: (in package9 truck1)
   goals met: 9 of 50
7. (load-truck s2 package45 truck1)
   deleted: (at package45 s2)
   added: (in package45 truck1)
   goals met: 9 of 50
8. (load-truck s2 package22 truck1)
   deleted: (at package22 s2)
   added: (in package22 truck1)
   goals met: 9 of 50
9. (drive-truck driver3 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 9 of 50
10. (drive-truck driver3 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 10 of 50
11. (drive-truck driver3 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 9 of 50
12. (drive-truck driver3 s4 s6 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s6)
   goals met: 9 of 50
13. (load-truck s6 package8 truck1)
   deleted: (at package8 s6)
   added: (in package8 truck1)
   goals met: 9 of 50
14. (load-truck s6 package40 truck1)
   deleted: (at package40 s6)
   added: (in package40 truck1)
   goals met: 9 of 50
15. (drive-truck driver3 s6 s1 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   goals met: 10 of 50
16. (load-truck s1 package43 truck1)
   deleted: (at package43 s1)
   added: (in package43 truck1)
   goals met: 10 of 50
17. (load-truck s1 package1 truck1)
   deleted: (at package1 s1)
   added: (in package1 truck1)
   goals met: 10 of 50
18. (drive-truck driver3 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 9 of 50
19. (unload-truck s3 package45 truck1)
   deleted: (in package45 truck1)
   added: (at package45 s3)
   goals met: 10 of 50
20. (unload-truck s3 package43 truck1)
   deleted: (in package43 truck1)
   added: (at package43 s3)
   goals met: 11 of 50
21. (drive-truck driver3 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 12 of 50
22. (drive-truck driver3 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 11 of 50
23. (unload-truck s4 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s4)
   goals met: 12 of 50
24. (load-truck s4 package6 truck1)
   deleted: (at package6 s4)
   added: (in package6 truck1)
   goals met: 12 of 50
25. (drive-truck driver3 s4 s6 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s6)
   goals met: 12 of 50
26. (unload-truck s6 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s6)
   goals met: 13 of 50
27. (load-truck s6 package39 truck1)
   deleted: (at package39 s6)
   added: (in package39 truck1)
   goals met: 13 of 50
28. (drive-truck driver3 s6 s5 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   goals met: 13 of 50
29. (drive-truck driver2 s5 s1 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   goals met: 14 of 50
30. (drive-truck driver2 s1 s4 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   goals met: 13 of 50
31. (unload-truck s5 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s5)
   goals met: 14 of 50
32. (load-truck s5 package4 truck1)
   deleted: (at package4 s5)
   added: (in package4 truck1)
   goals met: 14 of 50
33. (load-truck s5 package36 truck1)
   deleted: (at package36 s5)
   added: (in package36 truck1)
   goals met: 14 of 50
34. (load-truck s5 package23 truck1)
   deleted: (at package23 s5)
   added: (in package23 truck1)
   goals met: 14 of 50
35. (unload-truck s5 package22 truck1)
   deleted: (in package22 truck1)
   added: (at package22 s5)
   goals met: 15 of 50
36. (load-truck s5 package21 truck1)
   deleted: (at package21 s5)
   added: (in package21 truck1)
   goals met: 15 of 50
37. (load-truck s5 package2 truck1)
   deleted: (at package2 s5)
   added: (in package2 truck1)
   goals met: 15 of 50
38. (load-truck s5 package16 truck1)
   deleted: (at package16 s5)
   added: (in package16 truck1)
   goals met: 15 of 50
39. (load-truck s5 package12 truck1)
   deleted: (at package12 s5)
   added: (in package12 truck1)
   goals met: 15 of 50
40. (drive-truck driver3 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 16 of 50
41. (unload-truck s1 package36 truck1)
   deleted: (in package36 truck1)
   added: (at package36 s1)
   goals met: 17 of 50
42. (unload-truck s1 package23 truck1)
   deleted: (in package23 truck1)
   added: (at package23 s1)
   goals met: 18 of 50
43. (drive-truck driver3 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 17 of 50
44. (load-truck s5 package10 truck1)
   deleted: (at package10 s5)
   added: (in package10 truck1)
   goals met: 17 of 50
45. (drive-truck driver3 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 18 of 50
46. (unload-truck s1 package12 truck1)
   deleted: (in package12 truck1)
   added: (at package12 s1)
   goals met: 19 of 50
47. (unload-truck s1 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s1)
   goals met: 20 of 50
48. (drive-truck driver3 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 19 of 50
49. (unload-truck s3 package40 truck1)
   deleted: (in package40 truck1)
   added: (at package40 s3)
   goals met: 20 of 50
50. (drive-truck driver3 s3 s5 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 20 of 50
51. (drive-truck driver3 s5 s6 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   goals met: 20 of 50
52. (load-truck s6 package38 truck1)
   deleted: (at package38 s6)
   added: (in package38 truck1)
   goals met: 20 of 50
53. (drive-truck driver3 s6 s5 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   goals met: 20 of 50
54. (load-truck s4 package44 truck2)
   deleted: (at package44 s4)
   added: (in package44 truck2)
   goals met: 20 of 50
55. (drive-truck driver2 s4 s6 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   goals met: 20 of 50
56. (unload-truck s6 package44 truck2)
   deleted: (in package44 truck2)
   added: (at package44 s6)
   goals met: 21 of 50
57. (load-truck s6 package27 truck2)
   deleted: (at package27 s6)
   added: (in package27 truck2)
   goals met: 21 of 50
58. (drive-truck driver2 s6 s4 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s4)
   goals met: 21 of 50
59. (load-truck s4 package35 truck2)
   deleted: (at package35 s4)
   added: (in package35 truck2)
   goals met: 21 of 50
60. (load-truck s4 package29 truck2)
   deleted: (at package29 s4)
   added: (in package29 truck2)
   goals met: 21 of 50
61. (drive-truck driver2 s4 s1 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   goals met: 22 of 50
62. (unload-truck s1 package27 truck2)
   deleted: (in package27 truck2)
   added: (at package27 s1)
   goals met: 23 of 50
63. (drive-truck driver2 s1 s5 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   goals met: 22 of 50
64. (drive-truck driver2 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 22 of 50
65. (load-truck s0 package7 truck2)
   deleted: (at package7 s0)
   added: (in package7 truck2)
   goals met: 22 of 50
66. (drive-truck driver2 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 22 of 50
67. (unload-truck s3 package7 truck2)
   deleted: (in package7 truck2)
   added: (at package7 s3)
   goals met: 23 of 50
68. (drive-truck driver2 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 23 of 50
69. (unload-truck s2 package35 truck2)
   deleted: (in package35 truck2)
   added: (at package35 s2)
   goals met: 24 of 50
70. (load-truck s2 package19 truck2)
   deleted: (at package19 s2)
   added: (in package19 truck2)
   goals met: 24 of 50
71. (drive-truck driver2 s2 s5 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   goals met: 24 of 50
72. (drive-truck driver2 s5 s6 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s6)
   goals met: 24 of 50
73. (load-truck s6 package26 truck2)
   deleted: (at package26 s6)
   added: (in package26 truck2)
   goals met: 24 of 50
74. (load-truck s6 package25 truck2)
   deleted: (at package25 s6)
   added: (in package25 truck2)
   goals met: 24 of 50
75. (drive-truck driver2 s6 s4 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s4)
   goals met: 24 of 50
76. (unload-truck s4 package26 truck2)
   deleted: (in package26 truck2)
   added: (at package26 s4)
   goals met: 25 of 50
77. (drive-truck driver2 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 25 of 50
78. (unload-truck s5 package25 truck2)
   deleted: (in package25 truck2)
   added: (at package25 s5)
   goals met: 26 of 50
79. (load-truck s3 package41 truck3)
   deleted: (at package41 s3)
   added: (in package41 truck3)
   goals met: 26 of 50
80. (load-truck s3 package37 truck3)
   deleted: (at package37 s3)
   added: (in package37 truck3)
   goals met: 26 of 50
81. (load-truck s3 package34 truck3)
   deleted: (at package34 s3)
   added: (in package34 truck3)
   goals met: 26 of 50
82. (load-truck s3 package33 truck3)
   deleted: (at package33 s3)
   added: (in package33 truck3)
   goals met: 26 of 50
83. (drive-truck driver5 s3 s0 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   goals met: 26 of 50
84. (drive-truck driver3 s5 s3 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   goals met: 26 of 50
85. (unload-truck s3 package38 truck1)
   deleted: (in package38 truck1)
   added: (at package38 s3)
   goals met: 27 of 50
86. (load-truck s3 package30 truck1)
   deleted: (at package30 s3)
   added: (in package30 truck1)
   goals met: 27 of 50
87. (drive-truck driver3 s3 s5 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 27 of 50
88. (unload-truck s5 package30 truck1)
   deleted: (in package30 truck1)
   added: (at package30 s5)
   goals met: 28 of 50
89. (load-truck s0 package46 truck3)
   deleted: (at package46 s0)
   added: (in package46 truck3)
   goals met: 28 of 50
90. (drive-truck driver5 s0 s5 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   goals met: 29 of 50
91. (walk driver4 s0 p4-0)
   deleted: (at driver4 s0)
   added: (at driver4 p4-0)
   goals met: 29 of 50
92. (walk driver4 p4-0 s4)
   deleted: (at driver4 p4-0)
   added: (at driver4 s4)
   goals met: 29 of 50
93. (walk driver4 s4 p4-2)
   deleted: (at driver4 s4)
   added: (at driver4 p4-2)
   goals met: 29 of 50
94. (walk driver4 p4-2 s2)
   deleted: (at driver4 p4-2)
   added: (at driver4 s2)
   goals met: 30 of 50
95. (drive-truck driver2 s5 s6 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s6)
   goals met: 30 of 50
96. (unload-truck s6 package19 truck2)
   deleted: (in package19 truck2)
   added: (at package19 s6)
   goals met: 31 of 50
97. (drive-truck driver2 s6 s1 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   goals met: 32 of 50
98. (drive-truck driver3 s5 s3 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   goals met: 32 of 50
99. (load-truck s3 package17 truck1)
   deleted: (at package17 s3)
   added: (in package17 truck1)
   goals met: 32 of 50
100. (drive-truck driver3 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 33 of 50
101. (drive-truck driver3 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 32 of 50
102. (drive-truck driver2 s1 s5 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   goals met: 31 of 50
103. (drive-truck driver2 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 31 of 50
104. (unload-truck s0 package29 truck2)
   deleted: (in package29 truck2)
   added: (at package29 s0)
   goals met: 32 of 50
105. (drive-truck driver2 s0 s5 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   goals met: 32 of 50
106. (drive-truck driver2 s5 s1 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   goals met: 33 of 50
107. (drive-truck driver3 s5 s4 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   goals met: 33 of 50
108. (load-truck s4 package24 truck1)
   deleted: (at package24 s4)
   added: (in package24 truck1)
   goals met: 33 of 50
109. (drive-truck driver3 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 34 of 50
110. (drive-truck driver3 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 33 of 50
111. (drive-truck driver5 s5 s0 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   goals met: 32 of 50
112. (unload-truck s0 package41 truck3)
   deleted: (in package41 truck3)
   added: (at package41 s0)
   goals met: 33 of 50
113. (unload-truck s0 package37 truck3)
   deleted: (in package37 truck3)
   added: (at package37 s0)
   goals met: 34 of 50
114. (drive-truck driver5 s0 s5 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   goals met: 35 of 50
115. (drive-truck driver3 s5 s3 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   goals met: 35 of 50
116. (unload-truck s3 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s3)
   goals met: 36 of 50
117. (drive-truck driver3 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 37 of 50
118. (drive-truck driver3 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 36 of 50
119. (unload-truck s4 package17 truck1)
   deleted: (in package17 truck1)
   added: (at package17 s4)
   goals met: 37 of 50
120. (drive-truck driver3 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 38 of 50
121. (drive-truck driver3 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 37 of 50
122. (drive-truck driver5 s5 s1 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   goals met: 36 of 50
123. (unload-truck s1 package46 truck3)
   deleted: (in package46 truck3)
   added: (at package46 s1)
   goals met: 37 of 50
124. (drive-truck driver5 s1 s4 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   goals met: 37 of 50
125. (drive-truck driver5 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 38 of 50
126. (drive-truck driver5 s5 s2 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   goals met: 37 of 50
127. (unload-truck s2 package34 truck3)
   deleted: (in package34 truck3)
   added: (at package34 s2)
   goals met: 38 of 50
128. (drive-truck driver5 s2 s5 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   goals met: 39 of 50
129. (drive-truck driver5 s5 s4 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   goals met: 38 of 50
130. (unload-truck s4 package33 truck3)
   deleted: (in package33 truck3)
   added: (at package33 s4)
   goals met: 39 of 50
131. (drive-truck driver5 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 40 of 50
132. (drive-truck driver5 s5 s2 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   goals met: 39 of 50
133. (load-truck s2 package18 truck3)
   deleted: (at package18 s2)
   added: (in package18 truck3)
   goals met: 39 of 50
134. (drive-truck driver5 s2 s5 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   goals met: 40 of 50
135. (drive-truck driver5 s5 s4 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   goals met: 39 of 50
136. (unload-truck s4 package18 truck3)
   deleted: (in package18 truck3)
   added: (at package18 s4)
   goals met: 40 of 50
137. (drive-truck driver5 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 41 of 50
138. (drive-truck driver3 s5 s4 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   goals met: 41 of 50
139. (unload-truck s4 package16 truck1)
   deleted: (in package16 truck1)
   added: (at package16 s4)
   goals met: 42 of 50
140. (drive-truck driver3 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 43 of 50
141. (drive-truck driver3 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 42 of 50
142. (drive-truck driver3 s5 s0 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   goals met: 42 of 50
143. (unload-truck s0 package39 truck1)
   deleted: (in package39 truck1)
   added: (at package39 s0)
   goals met: 43 of 50
144. (drive-truck driver3 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 43 of 50
145. (drive-truck driver3 s5 s2 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   goals met: 43 of 50
146. (unload-truck s2 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s2)
   goals met: 44 of 50
147. (unload-truck s2 package24 truck1)
   deleted: (in package24 truck1)
   added: (at package24 s2)
   goals met: 45 of 50
148. (drive-truck driver3 s2 s5 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   goals met: 45 of 50
149. (drive-truck driver3 s5 s0 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   goals met: 45 of 50
150. (unload-truck s0 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s0)
   goals met: 46 of 50
151. (drive-truck driver5 s5 s0 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   goals met: 45 of 50
152. (disembark-truck driver5 s0 truck3)
   deleted: (driving driver5 truck3)
   added: (at driver5 s0) (empty truck3)
   goals met: 46 of 50
153. (disembark-truck driver3 s0 truck1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 46 of 50
154. (board-truck driver5 s0 truck1)
   deleted: (at driver5 s0) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 45 of 50
155. (drive-truck driver5 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 45 of 50
156. (drive-truck driver5 s5 s6 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   goals met: 45 of 50
157. (disembark-truck driver5 s6 truck1)
   deleted: (driving driver5 truck1)
   added: (at driver5 s6) (empty truck1)
   goals met: 45 of 50
158. (walk driver3 s0 p0-1)
   deleted: (at driver3 s0)
   added: (at driver3 p0-1)
   goals met: 45 of 50
159. (walk driver3 p0-1 s1)
   deleted: (at driver3 p0-1)
   added: (at driver3 s1)
   goals met: 46 of 50
160. (walk driver5 s6 p0-6)
   deleted: (at driver5 s6)
   added: (at driver5 p0-6)
   goals met: 46 of 50
161. (walk driver5 p0-6 s0)
   deleted: (at driver5 p0-6)
   added: (at driver5 s0)
   goals met: 47 of 50
162. (board-truck driver5 s0 truck3)
   deleted: (at driver5 s0) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 46 of 50
163. (drive-truck driver2 s1 s6 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s6)
   goals met: 45 of 50
164. (disembark-truck driver2 s6 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s6) (empty truck2)
   goals met: 45 of 50
165. (board-truck driver2 s6 truck1)
   deleted: (at driver2 s6) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 45 of 50
166. (drive-truck driver5 s0 s5 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   goals met: 46 of 50
167. (drive-truck driver2 s6 s1 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   goals met: 47 of 50
168. (drive-truck driver5 s5 s6 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   goals met: 46 of 50
169. (disembark-truck driver5 s6 truck3)
   deleted: (driving driver5 truck3)
   added: (at driver5 s6) (empty truck3)
   goals met: 46 of 50
170. (drive-truck driver2 s1 s6 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   goals met: 45 of 50
171. (unload-truck s6 package21 truck1)
   deleted: (in package21 truck1)
   added: (at package21 s6)
   goals met: 46 of 50
172. (drive-truck driver2 s6 s1 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   goals met: 47 of 50
173. (board-truck driver5 s6 truck2)
   deleted: (at driver5 s6) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 47 of 50
174. (drive-truck driver5 s6 s1 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   goals met: 48 of 50
175. (disembark-truck driver5 s1 truck2)
   deleted: (driving driver5 truck2)
   added: (at driver5 s1) (empty truck2)
   goals met: 48 of 50
176. (walk driver5 s1 p0-1)
   deleted: (at driver5 s1)
   added: (at driver5 p0-1)
   goals met: 48 of 50
177. (drive-truck driver2 s1 s6 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   goals met: 47 of 50
178. (walk driver5 p0-1 s0)
   deleted: (at driver5 p0-1)
   added: (at driver5 s0)
   goals met: 48 of 50
179. (disembark-truck driver2 s6 truck1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s6) (empty truck1)
   goals met: 48 of 50
180. (board-truck driver2 s6 truck3)
   deleted: (at driver2 s6) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 48 of 50
181. (drive-truck driver2 s6 s5 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   goals met: 49 of 50
182. (walk driver5 s0 p0-6)
   deleted: (at driver5 s0)
   added: (at driver5 p0-6)
   goals met: 48 of 50
183. (walk driver5 p0-6 s6)
   deleted: (at driver5 p0-6)
   added: (at driver5 s6)
   goals met: 48 of 50
184. (board-truck driver5 s6 truck1)
   deleted: (at driver5 s6) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 48 of 50
185. (drive-truck driver5 s6 s1 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   goals met: 49 of 50
186. (disembark-truck driver5 s1 truck1)
   deleted: (driving driver5 truck1)
   added: (at driver5 s1) (empty truck1)
   goals met: 49 of 50
187. (walk driver5 s1 p0-1)
   deleted: (at driver5 s1)
   added: (at driver5 p0-1)
   goals met: 49 of 50
188. (walk driver5 p0-1 s0)
   deleted: (at driver5 p0-1)
   added: (at driver5 s0)
   goals met: 50 of 50
